app/views/pages/home.html.erb

      <ul>
        <li><%= link_to 'Motivation', category_path(Category.find_by(name: 'Motivation')) %></li>
        <li><%= link_to 'Wisdom', category_path(Category.find_by(name: 'Wisdom')) %></li>
        <li><%= link_to 'Life', category_path(Category.find_by(name: 'Life')) %></li>
        <li><%= link_to 'Philosophy', category_path(Category.find_by(name: 'Philosophy')) %></li>
        <li><%= link_to 'Happiness', category_path(Category.find_by(name: 'Happiness')) %></li>
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Motivation"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Wisdom"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Life"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Philosophy"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Happiness"], ["LIMIT", 1]]