app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes" WHERE (body LIKE '%happiness%')
SELECT "quotes".* FROM "quotes"
---
  def search
    if params[:query].present?
      @quotes = Quote.where("body LIKE ?", "%#{params[:query]}%")  # Searching by quote body
    else
      @quotes = Quote.all  # If no query is present, show all quotes