app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "status", "isAdmin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    @user.status ||= 'Active'  # Set default status if not provided
    @user.isAdmin ||= false    # Set default isAdmin to false if not provided

    respond_to do |format|
      if @user.save